[
    {
      "audit_report": "Securing Secp256k1 ECDH Against Small Subgroup Attacks - Hacken\n\nIn this report, the Hacken security team provides an in‐depth analysis of a critical vulnerability in the secp256k1 npm package that affects Elliptic Curve Diffie-Hellman (ECDH) key exchanges. The report explains how insufficient public key validation in the loadCompressedPublicKey function can allow attackers to introduce invalid or low-order points into the ECDH process. Without proper checks, such as verifying that the computed (x, y) coordinates satisfy the curve equation and ensuring that the point’s order is sufficiently high, an attacker can trigger small subgroup attacks. By collecting residues from ECDH exchanges with maliciously crafted public keys, an adversary can apply the Chinese Remainder Theorem (CRT) to gradually reconstruct parts of the victim's private key. The report covers the mathematical background of elliptic curve cryptography (ECC), the specific properties of the secp256k1 curve, and the importance of strict validation routines. Detailed steps are provided on how the attack is mounted, including the generation of malicious compressed public keys, residue extraction, and partial key recovery. The authors also discuss mitigation strategies such as enforcing comprehensive public key validation, integrating constant-time operations to avoid timing leaks, and updating the affected libraries to patched versions. This comprehensive review underlines that even a single oversight in cryptographic validation can expose critical weaknesses, emphasizing the need for rigorous audits and regular code updates to protect high-value assets in decentralized systems."
    },
    {
      "audit_report": "Radiant’s Automated Incident Response Was Not Ready for Access Control Attack\n\nThis audit report details the security breach experienced by Radiant Capital on October 16, 2024, resulting in a loss exceeding $50 million across multiple chains. The report explains that the attackers exploited a fundamental weakness in the protocol’s access control mechanisms, allowing them to transfer ownership of key contracts, such as the LendingPoolAddressesProvider. The exploit was executed through a multicall transaction that upgraded the lending pool implementation with malicious code and iterated over multiple market contracts to drain assets. Radiant’s automated incident response system, although pre-configured to pause operations on detecting abnormal activity, was unable to prevent the breach on the BNB Chain due to the nature of the access control flaw. The report provides a detailed timeline of events, starting with the Arbitrum attack at 17:09:18 UTC, followed by the delayed pausing of the lending pools on Ethereum and BNB Chain. It emphasizes that pausing the contract does not mitigate exploits rooted in compromised ownership and inadequate MultiSig monitoring. The findings stress the importance of monitoring MultiSig contracts and immediate remediation actions when unauthorized transactions are detected. In addition, the report includes recommendations for bolstering access control measures, such as enhancing real-time monitoring, implementing automated owner removal from compromised MultiSig wallets, and refining incident response protocols across chains. Overall, this case study serves as a stark reminder of the dynamic threat landscape in Web3 and the need for integrated security practices to safeguard critical financial infrastructures."
    },
    {
      "audit_report": "Key Discovery in ECDSA: Understanding Implementation and Security Risk\n\nThis comprehensive audit report delves into the intricacies of the Elliptic Curve Digital Signature Algorithm (ECDSA) and the critical importance of its correct implementation. The report begins by outlining the basics of ECDSA and elliptic curve cryptography (ECC), emphasizing how ECDSA enables secure digital signatures through the use of public and private keys, a cryptographic hash of the message, and a uniquely generated nonce. The authors explain that the security of ECDSA hinges on the unpredictability of the nonce and the careful management of all key components. However, the report also highlights several common pitfalls in real-world implementations, including nonce reuse, weak random number generators, and side-channel vulnerabilities. Detailed examples illustrate how a fixed or predictable nonce can lead to private key recovery, thereby compromising the entire cryptographic system. The report further examines the risks posed by timing attacks and power analysis, noting that even minute variations in execution time can leak sensitive information. Recommendations are provided to mitigate these risks, including the adoption of constant-time algorithms, use of cryptographically secure random number generators, and thorough testing against side-channel attacks. By reviewing both theoretical aspects and practical case studies, the report offers actionable insights for developers and security engineers, reinforcing the message that robust implementation practices are as critical as the underlying cryptographic algorithms in ensuring secure digital communications."
    },
    {
      "audit_report": "Ripple Hack Explained: A Deep Dive into the Recent XRP Heist\n\nIn this detailed audit report, Hacken examines the recent high-profile XRP heist that resulted in the illicit diversion of approximately 213 million XRP tokens, valued at around $112.5 million. The report provides an extensive analysis of the incident, tracing the flow of funds from a source address originally linked to Ripple to multiple recipient addresses across various exchanges. The investigation uncovered that the breach centered on compromised private keys, specifically those associated with a high-profile wallet linked to Chris Larsen, Ripple’s Co-founder and Executive Chairman. The report outlines the sequence of events, starting with the initial unauthorized transaction, followed by the rapid laundering of funds through intermediary wallets and centralized exchanges such as Kraken. It also discusses the role of blockchain analytics in tracking the stolen assets and the subsequent efforts by Ripple, in collaboration with law enforcement, to freeze the funds. The audit highlights the importance of stringent personal and institutional security practices, particularly for high-value wallets, and calls for improved real-time monitoring of wallet activities to detect anomalous transactions. Concluding with a set of recommendations, the report advises enhanced multi-layered security measures, proactive incident response planning, and robust key management practices. This case study serves as a crucial reminder of the ever-present risks in the crypto space and the need for continuous security vigilance to protect digital assets."
    },
    {
      "audit_report": "Onyx Protocol Hack Explained: A Deeper Dive Into $2.1M Exploit\n\nThis report provides a thorough analysis of the exploit that targeted Onyx Protocol, a Compound Finance fork, leading to a loss of 1164 ETH (approximately $2.1 million). The audit details how attackers exploited an empty pool vulnerability in the newly added PEPE market, taking advantage of an overvaluation created through strategic minting and borrowing processes. By leveraging a rounding error inherent in the protocol’s design, the attackers managed to redeem assets in excess of their rightful value, thereby draining liquidity from the system. The report further discusses how the inherent risks of forking can amplify vulnerabilities if lessons from previous incidents are not fully integrated into the new implementation. Detailed timelines and transaction flows are provided, illustrating how the exploit unfolded and the subsequent impact on the protocol’s total value locked (TVL), which plummeted from $2.9 million to $392K. The analysis highlights key areas of concern, including inadequate community oversight and insufficient safeguards during market initialization. Recommendations focus on introducing measures such as mint-and-burn mechanisms for new markets, zero collateral factors during initial deployment, and enhanced audit procedures that consider dynamic market conditions. Ultimately, this report underscores the importance of rigorous security reviews, proactive community engagement, and the need to learn from historical exploits to build more resilient DeFi platforms."
    },
    {
      "audit_report": "Heco Bridge Hack Explained\n\nThis audit report examines the sophisticated exploit targeting the Heco chain bridge, which resulted in an $87 million loss, compounded by an additional $12 million stolen from HTX hot wallets. The investigation reveals that the attack was orchestrated through the manipulation of asset transfers via the Heco bridge, followed by systematic laundering across multiple addresses. The report identifies key addresses involved in the exploit and provides a detailed flow of how the funds were diverted, swapped, and ultimately consolidated in specific holding wallets. Special attention is given to the compromised private keys that enabled the breach, drawing parallels to previous high-profile incidents in the space. In addition, the report discusses the technical details of the exploit, including the vulnerabilities in the bridge’s implementation that allowed for unauthorized transfers despite built-in safeguards. Mitigation strategies are proposed, such as implementing stricter access controls, real-time monitoring of bridge transactions, and enhanced recovery protocols for compromised wallets. The analysis also stresses the need for coordinated incident response strategies that extend across multiple chains to prevent the propagation of attacks from one network to another. In conclusion, the report calls for a holistic approach to security in multi-chain environments, emphasizing the importance of regular audits, robust key management, and proactive defense mechanisms to mitigate similar risks in the future."
    }
]